# latex
texlive-base
texlive-binaries
texlive-extra-utils
texlive-font-utils
texlive-fonts-recommended
texlive-latex-base
texlive-latex-extra
texlive-latex-recommended
texlive-luatex
texlive-pictures
texlive-plain-generic

# dev

## dev-tools
autoconf
automake
build-essential
ninja-build
cmake
cmake-doc
cmake-extras
jupyter-notebook
jupyter-qtconsole
jupyter-server
google-mock
googletest-tools

## dev-lsp
bash-completion

## dev-rust
cargo
https://www.rust-lang.org/tools/install

## dev-c
clang-format-15
clang-tidy-15
clangd-15
g++-10
g++-12
g++-mingw-w64
gcc-10-aarch64-linux-gnu
gcc-12-aarch64-linux-gnu
gcc-arm-none-eabi
gcc-arm-none-eabi-source
gdb
gdb-doc
libc++-14-dev
libc6

## dev-ruby
ruby-dev
ruby-full
gem

## dev-go
golang

## dev-java
openjdk-21-dbg
openjdk-21-doc
openjdk-21-jdk-headless
openjdk-21-jre

## dev-perl
perl

## dev-nvim
luarocks

## dev-python
python-is-python3
python-pycryptodome-doc
python3
python3-apport
python3-apt
python3-aptdaemon
python3-aptdaemon.gtk3widgets
python3-clang-15
python3-commandnotfound
python3-dev
python3-distupgrade
python3-exif
python3-flake8
python3-gdbm
python3-neovim
python3-piexif
python3-pip
python3-pycryptodome
python3-pylsp
python3-pynvim
python3-recommonmark
python3-software-properties
python3-sphinx
python3-sphinx-rtd-theme
python3-update-manager
python3-venv

# SQL
sqlite-doc
sqlite3-tools
sqlite3
sqlitebrowser

# embedded
mtools -- access DOS disks
pciutils
picocom
segger-jlink-udev-rules
setserial
st-stlink-server
st-stlink-udev-rules
st-stm32cubeide-1.11.0
stlink-gui
stlink-tools
stm32flash
udev
usb-creator-common
usb-creator-gtk
usbutils
usbview

# networking
tcpdump
netcat-openbsd
netcat
nmap
wireshark
iperf
iproute2
iptables
iputils-arping
iputils-ping
iputils-tracepath
ufw
gufw
snort
oinkmaster

# docker
docker-buildx-plugin
docker-ce-cli
docker-ce-rootless-extras
docker-ce
docker-compose-plugin
docker-scan-plugin
docker

# doxygen
doxygen-gui
doxygen-latex
doxygen

# images
exif
exifprobe
exiftags
gimp
gimp-data-extras
gimp-gutenprint
imagemagick
mediainfo

# fonts
fonts-dejavu-core
fonts-dejavu
fonts-ubuntu


# always
abs-guide
curl
fzf
gawk
gawk-doc
git
gitg
gnupg
gparted
gpg-agent
graphviz
grep
gzip
hostname
kitty
less
locate
lshw
lsof
nodejs
openssh-client
openssh-server
pdfgrep
procps
ripgrep
rsync
sed
time
tmux
tmux-plugin-manager
tree
unzip
wget
xclip
xz-utils
zip

# full desktop
bitwarden
firefox
genisoimage -- create ISO filesystem


# printing
cups-browsed
cups-bsd
cups-client
cups-filters
ghostwriter
pandoc
ps2eps
